Repository: capstanlqc-mtpe/CIDQ_BillingCode2026_fr-CA_omt
Catalog: omegat/project_save.tmx
Source language: en
Languages: fr_ca

source: An approved fire alarm system installed in accordance with the provisions of this code and NFPA 72 shall be provided in new buildings and structures in accordance with Sections 907.2.1 through 907.2.23 and provide occupant notification in accordance with Section 907.5, unless other requirements are provided by another section of this code.
fr_ca: Un système d’alarme d’incendie approuvé, installé conformément aux dispositions du présent code et de la norme NFPA 72, doit être prévu dans les bâtiments et constructions neufs conformément aux sections 907.2.1 à 907.2.23 et assurer la notification des occupants conformément à la section 907.5, sauf si d’autres exigences sont prévues par une autre section du présent code.

source: An approved pictorial sign of a standardized design shall be posted adjacent to each elevator call station on all floors instructing occupants to use the exit stairways and not to use the elevators in case of fire.
fr_ca: Un panneau pictographique approuvé de conception normalisée doit être installé à côté de chaque poste d’appel d’ascenseur à tous les étages pour indiquer aux occupants d’utiliser les escaliers d’issue et de ne pas utiliser les ascenseurs en cas d’incendie.

source: An assembly that has a fire-resistance rating of not less than 2 hours.
fr_ca: Un assemblage ayant un degré de résistance au feu d’au moins 2 heures.

source: An attached top rail or handrail is not required where the glass baluster panels are laminated glass with two or more glass plies of equal thickness and of the same glass type.
fr_ca: Une main courante ou une lisse supérieure rapportée n’est pas requise lorsque les panneaux de balustres en verre sont en verre feuilleté composé de deux plis de verre ou plus, d’épaisseur égale et du même type de verre.

source: An automatic secondary on-site water supply having a capacity not less than the hydraulically calculated sprinkler demand, including the hose stream requirement, shall be provided for high-rise buildings assigned to Seismic Design Category C, D, E or F as determined by Section 1613.
fr_ca: Une alimentation en eau secondaire automatique sur place, d’une capacité au moins égale à la demande en eau des extincteurs calculée hydrauliquement, y compris le débit requis pour les lances, doit être prévue pour les bâtiments de grande hauteur classés dans les catégories de conception sismique C, D, E ou F, conformément à l’article 1613.

source: An automatic smoke detection system shall be installed for highly toxic gases, organic peroxides and oxidizers in accordance with Chapters 60, 62 and 63, respectively, of the International Fire Code.
fr_ca: Un système automatique de détection de fumée doit être installé pour les gaz hautement toxiques, les peroxydes organiques et les oxydants conformément, respectivement, aux chapitres 60, 62 et 63 de l’International Fire Code.

source: An automatic smoke detection system that activates the occupant notification system in accordance with Section 907.5 shall be provided in accordance with Sections 907.2.6.1, 907.2.6.2 and 907.2.6.3.3.
fr_ca: Un système automatique de détection de fumée qui active le système de notification des occupants conformément à la section 907.5 doit être prévu conformément aux sections 907.2.6.1, 907.2.6.2 et 907.2.6.3.3.

source: An automatic sprinkler system installed in accordance with Section 903.3 shall be provided throughout all buildings with a Group R fire area.
fr_ca: Un système d'extincteurs automatiques installé selon la section 903.3 doit être prévu dans tous les bâtiments ayant une zone d'incendie du Groupe R.

source: An automatic sprinkler system installed in accordance with Section 903.3.1.2 shall be permitted in Group R-4, Condition 2 occupancies.
fr_ca: Un système d'extincteurs automatiques installé selon la section 903.3.1.2 est autorisé dans les usages du groupe R-4, condition 2.

source: An automatic sprinkler system installed in accordance with Section 903.3.1.3 shall be permitted in Group R-3 occupancies.
fr_ca: Un système d'extincteurs automatiques installé selon la section 903.3.1.3 doit être autorisé dans les usages du groupe R-3.

source: An automatic sprinkler system installed in accordance with Section 903.3.1.3 shall be permitted in Group R-4, Condition 1 occupancies.
fr_ca: Un système d'extincteurs automatiques installé selon la section 903.3.1.3 est autorisé dans les usages du groupe R-4, condition 1.

source: An automatic sprinkler system installed in accordance with Section 903.3.1.3 shall be permitted in care facilities with five or fewer individuals in a single-family dwelling.
fr_ca: Un système d’extincteurs automatiques installé conformément à la section 903.3.1.3 peut être prévu dans les établissements de soins comptant au plus cinq personnes dans une habitation unifamiliale.

source: An automatic sprinkler system shall be installed at the top of rubbish and linen chutes and in their terminal rooms.
fr_ca: Un système d’extincteurs automatiques doit être installé au sommet des vide-ordures et des vide-linge ainsi que dans leurs locaux terminaux.

source: An automatic sprinkler system shall be installed in commercial kitchen exhaust hood and duct systems where an automatic sprinkler system is used to comply with Section 904.
fr_ca: Un système d’extincteurs automatiques doit être installé dans les systèmes de hottes et de gaines d’évacuation des cuisines commerciales lorsqu’un système d’extincteurs automatiques est utilisé pour satisfaire aux exigences de la section 904.

source: An automatic sprinkler system shall be installed throughout all stories, including basements, of all buildings where the floor area exceeds 1,500 square feet (139.4 m2) and where the story does not comply with the following criteria for exterior wall openings:
fr_ca: Un système d’extincteurs automatiques doit être installé dans tous les étages, y compris les sous-sols, de tous les bâtiments dont la superficie de plancher est supérieure à 1 500 pieds carrés (139,4 m2) et dont l’étage ne respecte pas les critères suivants relatifs aux ouvertures dans les murs extérieurs :

source: An automatic sprinkler system shall be installed throughout buildings that have one or more stories with an occupant load of 30 or more located 55 feet (16 764 mm) or more above the lowest level of fire department vehicle access, measured to the finished floor.
fr_ca: Un système d’extincteurs automatiques doit être installé dans tous les bâtiments comportant un ou plusieurs étages dont la charge d’occupants est d’au moins 30 personnes et qui sont situés à 55 pieds (16 764 mm) ou plus au-dessus du niveau le plus bas d’accès des véhicules du service d’incendie, la mesure étant prise jusqu’au plancher fini.

source: An automatic sprinkler system shall be installed throughout the entire floor containing an ambulatory care facility where either of the following conditions exist at any time:
fr_ca: Un système d'extincteurs automatiques doit être installé sur l'ensemble de l'étage contenant un établissements de soins ambulatoires lorsque l'une des conditions suivantes existe à tout moment :

source: An automatic sprinkler system shall be provided for Group E occupancies as follows:
fr_ca: Un système d’extincteurs automatiques doit être prévu pour les usages du groupe E comme suit :

source: An automatic sprinkler system shall be provided for all enclosed Group A-5 accessory use areas in excess of 1,000 square feet (93 m2).
fr_ca: Un système d'extincteurs automatiques doit être prévu pour toutes les aires d'usage accessoire fermées du groupe A-5 de plus de 1000 pi2 [93 m2].

source: An automatic sprinkler system shall be provided in accordance with the International Fire Code in all buildings of Group M where storage of merchandise is in high-piled or rack storage arrays.
fr_ca: Un système d’extincteurs automatiques doit être prévu conformément à l’International Fire Code dans tous les bâtiments du groupe M où des marchandises sont entreposées en hauteur ou sur des rayonnages.

source: An automatic sprinkler system shall be provided throughout a Group F-1 fire area that exceeds 2,500 square feet (232 m2) used for the manufacture of upholstered furniture or mattresses.
fr_ca: Un système d’extincteurs automatiques doit être prévu dans toute aire d’incendie du groupe F-1 d’une superficie supérieure à 2 500 pieds carrés (232 m²) utilisée pour la fabrication de meubles rembourrés ou de matelas.

source: An automatic sprinkler system shall be provided throughout a Group F-1 fire area used for the manufacture of distilled spirits.
fr_ca: Un système d'extincteurs automatiques doit être prévu dans toute la zone d'incendie du Groupe F-1 utilisée pour la fabrication de spiritueux distillés.

source: An automatic sprinkler system shall be provided throughout a Group M fire area where the area used for the display and sale of upholstered furniture or mattresses exceeds 5,000 square feet (464 m2).
fr_ca: Un système d’extincteurs automatiques doit être prévu dans toute aire d’incendie du groupe M où la superficie utilisée pour l’exposition et la vente de meubles rembourrés ou de matelas est supérieure à 5 000 pieds carrés (464 m2).

source: An automatic sprinkler system shall be provided throughout a Group S-1 fire area used for the bulk storage of distilled spirits or wine.
fr_ca: Un système d'extincteurs automatiques doit être prévu dans toute la zone d'incendie du groupe S-1 utilisée pour l'entreposage en vrac de spiritueux distillés ou de vin.

source: An automatic sprinkler system shall be provided throughout a Group S-1 fire area where the area used for the storage of upholstered furniture or mattresses exceeds 2,500 square feet (232 m2).
fr_ca: Un système d’extincteurs automatiques doit être prévu dans toute aire d’incendie du groupe S-1 où la superficie utilisée pour l’entreposage de meubles rembourrés ou de matelas est supérieure à 2500 pi2 [232 m2].

source: An automatic sprinkler system shall be provided throughout all Group F-1 occupancy fire areas that contain woodworking operations in excess of 2,500 square feet (232 m2) in area that generate finely divided combustible waste or use finely divided combustible materials.
fr_ca: Un système d’extincteurs automatiques doit être prévu dans toutes les aires d’incendie des usages du groupe F-1 qui comportent des opérations de menuiserie sur une superficie supérieure à 2 500 pieds carrés (232 m²) et qui génèrent des déchets combustibles finement divisés ou utilisent des matériaux combustibles finement divisés.

source: An automatic sprinkler system shall be provided throughout all buildings containing a Group F-1 occupancy where one of the following conditions exists:
fr_ca: Un système d'extincteurs automatiques doit être installé dans tous les bâtiments contenant une occupation du groupe F-1 lorsque l'une des conditions suivantes existe :

source: An automatic sprinkler system shall be provided throughout all buildings containing a Group S-1 occupancy where one of the following conditions exists:
fr_ca: Un système d'extincteurs automatiques doit être installé dans tous les bâtiments contenant une occupation du groupe S-1 lorsque l'une des conditions suivantes existe :

source: An automatic sprinkler system shall be provided throughout all buildings used as repair garages in accordance with Section 406, as shown:
fr_ca: Un système d’extincteurs automatiques doit être prévu dans tous les bâtiments utilisés comme garages de réparation conformément à la section 406, comme suit :

source: An automatic sprinkler system shall be provided throughout buildings and portions thereof used as Group A occupancies as provided in this section.
fr_ca: Un système d'extincteurs automatiques doit être prévu dans l'ensemble des bâtiments et des parties de ceux-ci utilisés comme usages du groupe A, conformément à la présente section.

source: An automatic sprinkler system shall be provided throughout buildings classified as parking garages where any of the following conditions exists:
fr_ca: Un système d'extincteurs automatiques doit être installé dans tous les bâtiments classés comme parcs de stationnement lorsque l'une des conditions suivantes existe :

source: An automatic sprinkler system shall be provided throughout buildings containing a Group M occupancy where one of the following conditions exists:
fr_ca: Un système d'extincteurs automatiques doit être installé dans tous les bâtiments contenant une occupation du groupe M lorsque l'une des conditions suivantes existe :

source: An automatic sprinkler system shall be provided throughout buildings used for storage of commercial motor vehicles where the fire area exceeds 5,000 square feet (464 m2).
fr_ca: Un système d'extincteurs automatiques doit être prévu dans tous les bâtiments utilisés pour l'entreposage de véhicules automobiles commerciaux lorsque la superficie de la zone d'incendie excède 5000 pi2 [464 m2].

source: An automatic sprinkler system shall be provided throughout buildings with a Group I fire area.
fr_ca: Un système d'extincteurs automatiques doit être prévu dans tous les bâtiments comportant une zone d'incendie du Groupe I.

source: An automatic sprinkler system shall be provided throughout stories containing Group A-1 occupancies and throughout all stories from the Group A-1 occupancy to and including the levels of exit discharge serving that occupancy where one of the following conditions exists:
fr_ca: Un système d’extincteurs automatiques doit être prévu dans tous les étages comportant des usages du groupe A-1 ainsi que dans tous les étages, depuis l’usage du groupe A-1 jusqu’aux niveaux d’évacuation menant à l’extérieur inclusivement, qui desservent cet usage, lorsqu’une des conditions suivantes est présente :

source: An automatic sprinkler system shall be provided throughout stories containing Group A-2 occupancies and throughout all stories from the Group A-2 occupancy to and including the levels of exit discharge serving that occupancy where one of the following conditions exists:
fr_ca: Un système d’extincteurs automatiques doit être prévu dans tous les étages comportant des usages du groupe A-2 ainsi que dans tous les étages, depuis l’usage du groupe A-2 jusqu’aux niveaux des issues d’évacuation menant à l’extérieur inclusivement, qui desservent cet usage, lorsqu’une des conditions suivantes est présente :

source: An automatic sprinkler system shall be provided throughout stories containing Group A-3 occupancies and throughout all stories from the Group A-3 occupancy to and including the levels of exit discharge serving that occupancy where one of the following conditions exists:
fr_ca: Un système d’extincteurs automatiques doit être prévu dans tous les étages comportant des usages du groupe A-3 ainsi que dans tous les étages, depuis l’usage du groupe A-3 jusqu’aux niveaux des issues d’évacuation menant à l’extérieur inclusivement, qui desservent cet usage, lorsqu’une des conditions suivantes est présente :

source: An automatic sprinkler system shall be provided throughout stories containing Group A-4 occupancies and throughout all stories from the Group A-4 occupancy to and including the levels of exit discharge serving that occupancy where one of the following conditions exists:
fr_ca: Un système d’extincteurs automatiques doit être prévu dans tous les étages comportant des usages du groupe A-4 ainsi que dans tous les étages, depuis l’usage du groupe A-4 jusqu’aux niveaux des issues d’évacuation menant à l’extérieur inclusivement, qui desservent cet usage, lorsqu’une des conditions suivantes est présente :

source: An automatic sprinkler system shall be provided where multiple fire areas of Group A-1, A-2, A-3 or A-4 occupancies share exit or exit access components and the combined occupant load of theses fire areas is 300 or more.
fr_ca: Un système d’extincteurs automatiques doit être prévu lorsque plusieurs aires d’incendie correspondant à des usages des groupes A-1, A-2, A-3 ou A-4 partagent des éléments des issues ou des voies d’accès aux issues et que la charge d’occupants combinée de ces aires d’incendie est de 300 personnes ou plus.

source: An automatic sprinkler system shall not be required in spaces or areas of telecommunications equipment buildings used exclusively for telecommunications equipment, associated electrical power distribution equipment, batteries and standby engines, provided that those spaces or areas are equipped throughout with an automatic fire detection system in accordance with Section 907.2 and are separated from the remainder of the building by not less than 1-hour fire barriers constructed in accordance with Section 707 or not less than 2-hour horizontal assemblies constructed in accordance with Section 711, or both.
fr_ca: Un système d'extincteurs automatiques n’est pas exigé dans les espaces ou zones des bâtiments abritant des équipements de télécommunications qui sont utilisés exclusivement pour les équipements de télécommunications, les équipements associés de distribution d’énergie électrique, les batteries et les moteurs de secours, à condition que ces espaces ou zones soient entièrement équipés d’un système automatique de détection d’incendie conforme à l’article 907.2 et soient séparés du reste du bâtiment par des barrières coupe-feu d’au moins 1 heure construites conformément à l’article 707 ou par des ensembles horizontaux d’au moins 2 heures construits conformément à l’article 711, ou par les deux.

source: An emergency escape and rescue opening with the bottom of the clear opening below the adjacent grade shall be provided with an area well in accordance with Sections 1031.5.1 through 1031.5.3.
fr_ca: Une ouverture d’évacuation d’urgence et de sauvetage dont le bas de l’ouverture libre est situé sous le niveau du sol adjacent doit être munie d’un puit de fenêtre conforme aux sections 1031.5.1 à 1031.5.3.

source: An emergency power system complying with Section 2702 shall be provided for the emergency power loads specified in Section 403.4.8.4.
fr_ca: Un système d’alimentation électrique d’urgence conforme à l’article 2702 doit être prévu pour les charges d’alimentation électrique d’urgence spécifiées à l’article 403.4.8.4.

source: An emergency voice/alarm communication system shall be provided in accordance with Section 907.5.2.2.
fr_ca: Un système de communication vocale et d'alarme d'urgence doit être prévu selon la section 907.5.2.2.

source: An end maneuvering clearance 24 inches (610 mm) minimum in width shall be permitted where a clear floor space complying with Section 305.3 is provided within the room beyond the maneuvering clearances for the changing surface.
fr_ca: Un espace de dégagement d'extrémité d'au moins 24 po [610 mm] de largeur est autorisé lorsqu'une surface de plancher dégagée conforme à la section 305.3 est prévue dans la pièce au-delà des espaces de dégagement pour la surface à langer.

source: An end maneuvering clearance 36 inches minimum in width shall be provided along the depth of one end of the changing surface.
fr_ca: Un espace de manœuvre d'extrémité d'une largeur minimale de 36 pouces doit être prévu le long de la profondeur d'une extrémité de la surface à langer.

source: An entry 36 inches (915 mm) minimum in width shall be provided at one end of the 60-inch (1525 mm) width of the compartment.
fr_ca: Il faut prévoir une entrée d'une largeur minimale de 36 po [915 mm] à une extrémité de la largeur de 60 po [1525 mm] du compartiment.

source: An entry 36 inches (915 mm) minimum in width shall be provided.
fr_ca: Une entrée d'une largeur minimale de 36 po [915 mm] doit être prévue.

source: An entry 60 inches (1525 mm) minimum in width shall be provided.
fr_ca: Une entrée d'une largeur minimale de 60 po [1525 mm] doit être prévue.

source: An exit passageway shall not be used for any purpose other than as a means of egress and a circulation path.
fr_ca: Un passage de sortie ne doit pas être utilisé à d'autres fins que comme moyen d'évacuation et voie de circulation.

source: An exit shall not be used for any purpose that interferes with its function as a means of egress.
fr_ca: Une issue ne doit pas être utilisée à des fins qui entravent sa fonction de moyen d'évacuation.

source: An interior exit stairway and ramp shall not continue below its level of exit discharge unless an approved barrier is provided at the level of exit discharge to prevent persons from unintentionally continuing into levels below.
fr_ca: Un escalier et une rampe d'issue intérieurs ne doivent pas se prolonger en dessous de leur niveau d'issue d'évacuation, sauf si une barrière approuvée est prévue au niveau de l'issue d'évacuation pour empêcher les personnes de continuer à se déplacer involontairement vers les niveaux inférieurs.

source: An interior exit stairway or ramp shall not be used for any purpose other than as a means of egress and a circulation path.
fr_ca: Un escalier ou une rampe d'issue intérieurs ne doivent pas être utilisés à d'autres fins que comme moyen d'évacuation et voie de circulation.

source: An occupied roof shall not be included in the building height or number of stories as regulated by Section 504, provided that the penthouses and other enclosed rooftop structures comply with Section 1511.
fr_ca: Un toit occupé ne doit pas être pris en compte dans la hauteur du bâtiment ni dans le nombre d’étages réglementés par la section 504, à condition que les pavillons et autres constructions fermées en toiture soient conformes à la section 1511.

source: An open side shall have not less than 35 square feet (3.3 m2) of aggregate open area adjacent to each floor level and the level of each intermediate landing.
fr_ca: Un côté ouvert doit avoir au moins 35 pi2 (3,3 m2) d'aire ouverte totale adjacente à chaque niveau du sol et au niveau de chaque palier intermédiaire.

source: Anchorage shall conform to the requirements of Section R1001.4.1.
fr_ca: L'ancrage doit être conforme aux exigences de l'article R1001.4.1.

source: Anchorageb
fr_ca: Ancrageb

source: Any other approved design that will produce equivalent results.
fr_ca: Toute autre conception approuvée qui produira des résultats équivalents.

source: Any other wall materials that provide impact resistance equivalent to that required by Sections 403.2.2.1 for Soft Body Impact Classification Level 2 and 403.2.2.2 for Hard Body Impact Classification Level 3, as measured by the test method described in ASTM C1629/C1629M, shall be permitted.
fr_ca: Tout autre matériau de mur offrant une résistance aux impacts équivalente à celle exigée à l’article 403.2.2.1 pour le niveau 2 de la classification de résistance aux impacts de corps mous et à l’article 403.2.2.2 pour le niveau 3 de la classification de résistance aux impacts de corps durs, selon la méthode d’essai décrite dans la norme ASTM C1629/C1629M, est autorisé.
